<a href="https://colab.research.google.com/github/havigowda9625/AIML-DS-/blob/main/Pandas_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [3]:
pds=pd.read_excel("/content/Sample - Superstore.xls")

#Descriptive & Basic Queries (Questions 1-50)

In [4]:
# Question 1: Find total number of orders in the dataset.
pds['Order ID'].unique()

array(['CA-2016-152156', 'CA-2016-138688', 'US-2015-108966', ...,
       'CA-2014-110422', 'CA-2017-121258', 'CA-2017-119914'], dtype=object)

In [5]:
# Question 2: Find the earliest order date.
pds['Order Date'].min()

Timestamp('2014-01-03 00:00:00')

In [6]:
# Question 3: Find the latest order date.
pds['Order Date'].max()

Timestamp('2017-12-30 00:00:00')

In [7]:
# Question 4: Find the total number of unique customers.
N=pds['Customer Name'].unique()
M=len(N)
M

793

In [8]:
# Question 5: Find the total number of unique products sold.
pd.Series(pds['Product ID'].unique())

0       FUR-BO-10001798
1       FUR-CH-10000454
2       OFF-LA-10000240
3       FUR-TA-10000577
4       OFF-ST-10000760
             ...
1857    TEC-PH-10002817
1858    TEC-MA-10003589
1859    OFF-AP-10003099
1860    TEC-PH-10002645
1861    OFF-ST-10001627
Length: 1862, dtype: object

In [9]:
# Question 6: Find the total number of unique categories.
pd.Series(pds['Category'].unique())

0          Furniture
1    Office Supplies
2         Technology
dtype: object

In [10]:
# Question 7: Find the total number of unique sub-categories.
pd.Series(pds['Sub-Category'].unique())

0       Bookcases
1          Chairs
2          Labels
3          Tables
4         Storage
5     Furnishings
6             Art
7          Phones
8         Binders
9      Appliances
10          Paper
11    Accessories
12      Envelopes
13      Fasteners
14       Supplies
15       Machines
16        Copiers
dtype: object

In [11]:
# Question 8: Count number of orders in each region.
pds['Region'].value_counts()

Region
West       3203
East       2848
Central    2323
South      1620
Name: count, dtype: int64

In [12]:
# Question 9: Count number of orders by state.
pds['State'].value_counts()

State
California              2001
New York                1128
Texas                    985
Pennsylvania             587
Washington               506
Illinois                 492
Ohio                     469
Florida                  383
Michigan                 255
North Carolina           249
Arizona                  224
Virginia                 224
Georgia                  184
Tennessee                183
Colorado                 182
Indiana                  149
Kentucky                 139
Massachusetts            135
New Jersey               130
Oregon                   124
Wisconsin                110
Maryland                 105
Delaware                  96
Minnesota                 89
Connecticut               82
Missouri                  66
Oklahoma                  66
Alabama                   61
Arkansas                  60
Rhode Island              56
Utah                      53
Mississippi               53
South Carolina            42
Louisiana                 42
Nevada                    39
Nebraska                  38
New Mexico                37
Iowa                      30
New Hampshire             27
Kansas                    24
Idaho                     21
Montana                   15
South Dakota              12
Vermont                   11
District of Columbia      10
Maine                      8
North Dakota               7
West Virginia              4
Wyoming                    1
Name: count, dtype: int64

In [13]:
# Question 10: Count number of orders by city.
pds['City'].value_counts()

City
New York City    915
Los Angeles      747
Philadelphia     537
San Francisco    510
Seattle          428
                ...
Abilene            1
Montebello         1
Kissimmee          1
Danbury            1
Springdale         1
Name: count, Length: 531, dtype: int64

In [14]:
# Question 11: Find the most common ship mode.
N=pds['Ship Mode'].max()
N

'Standard Class'

In [15]:
# Question 12: Find the least common ship mode.
M=pds['Ship Mode'].min()
M

'First Class'

In [16]:
# Question 13: Count number of orders shipped with "Same Day" mode.
N=pds['Ship Mode'].value_counts()['Same Day']
N

np.int64(543)

In [17]:
# Question 14: Count number of orders shipped with "First Class".
M=pds['Ship Mode'].value_counts()['First Class']
M

np.int64(1538)

In [18]:
# Question 15: Count number of orders shipped with "Second Class".
M=pds['Ship Mode'].value_counts()['Second Class']
M

np.int64(1945)

In [19]:
# Question 16: Count number of orders shipped with "Standard Class".
M=pds['Ship Mode'].value_counts()['Standard Class']
M

np.int64(5968)

In [20]:
# Question 17: Find number of orders in each year.
M=pds['Order Date'].dt.year.value_counts()
M

Order Date
2017    3312
2016    2587
2015    2102
2014    1993
Name: count, dtype: int64

In [21]:
# Question 18: Find number of orders in each quarter.
M=pds['Order Date'].dt.quarter.value_counts()
M

Order Date
4    3698
3    2799
2    2120
1    1377
Name: count, dtype: int64

In [22]:
# Question 19: Find number of orders in each month.
M=pds['Order Date'].dt.month.value_counts()
M

Order Date
11    1471
12    1408
9     1383
10     819
5      735
6      717
7      710
8      706
3      696
4      668
1      381
2      300
Name: count, dtype: int64

In [23]:
# Question 20: Find number of orders in each weekday.
M=pds['Order Date'].dt.weekday.value_counts()
M

Order Date
0    1871
4    1818
6    1710
5    1655
3    1463
1    1106
2     371
Name: count, dtype: int64

In [24]:
# Question 21: Count orders with discount applied.
da=pds['Discount'].apply(lambda x:x>0).sum()
da

np.int64(5196)

In [25]:
# Question 22: Count orders without discount.
da=pds['Discount'].apply(lambda x:x<0).sum()
da

np.int64(0)

In [26]:
# Question 23: Count orders where discount = 0.
da=pds['Discount'].apply(lambda x:x==0).sum()
da

np.int64(4798)

In [27]:
# Question 24: Count orders where discount > 0.2.
da=pds['Discount'].apply(lambda x:x>0.2).sum()
da

np.int64(1393)

In [28]:
# Question 25: Count orders where discount = 0.5.
da=pds['Discount'].apply(lambda x:x>0.5).sum()
da

np.int64(856)

In [29]:
# Question 26: Find maximum discount given.
da=pds['Discount'].max()
da

0.8

In [30]:
# Question 27: Find minimum discount given.
da=pds['Discount'].min()
da

0.0

In [31]:
# Question 28: Count orders where profit < 0.
p=pds['Profit'].apply(lambda x:x<0).sum()
p

np.int64(1871)

In [32]:
# Question 29: Count orders where profit = 0.
p=pds['Profit'].apply(lambda x:x==0).sum()
p

np.int64(65)

In [33]:
# Question 30: Count orders where profit > 100.
p=pds['Profit'].apply(lambda x:x>100).sum()
p

np.int64(890)

In [34]:
# Question 31: Count orders where sales > 1000.
s=pds['Sales'].apply(lambda x:x>1000).sum()
s

np.int64(468)

In [35]:
# Question 32: Find total quantity sold.
s=pds['Quantity'].sum()
s

np.int64(37873)

In [36]:
# Question 33: Find average quantity per order.
aq=pds['Order ID'].value_counts().sum()
aq

np.int64(9994)

In [37]:
# Question 34: Find average sales per order.
pds['Sales'].value_counts().sum()

np.int64(9994)

In [38]:
# Question 35: Find average profit per order.
pds['Profit'].value_counts().sum()

np.int64(9994)

In [39]:
# Question 36: Find maximum sales in a single order.
ms=pds.groupby('Order ID')['Sales'].sum().max()
ms

23661.228

In [40]:
# Question 37: Find minimum sales in a single order.
ms=pds.groupby('Order ID')['Sales'].sum().min()
ms

0.5559999999999998

In [41]:
# Question 38: Find maximum profit in a single order.
mp=pds.groupby('Order ID')['Profit'].sum().max()
mp

8762.389099999999

In [42]:
# Question 39: Find minimum profit in a single order.
mp=pds.groupby('Order ID')['Profit'].sum().min()
mp

-6892.3748000000005

In [43]:
# Question 40: Find number of orders per customer.
nop=pds.groupby('Order ID')['Customer ID'].sum().value_counts()
nop

Customer ID
EP-13915                                    9
EB-13870                                    9
GM-14500                                    8
SZ-20035                                    8
BM-11785                                    8
                                           ..
JE-16165                                    1
CC-12370CC-12370                            1
AB-10600AB-10600AB-10600AB-10600AB-10600    1
DP-13000DP-13000DP-13000                    1
FM-14290FM-14290FM-14290FM-14290FM-14290    1
Name: count, Length: 2380, dtype: int64

In [44]:
# Question 41: Find customers who placed only 1 order.
wp=pds.groupby('Order ID')['Customer Name'].sum()
wp.unique()

array(['Dennis Kane', 'Ed BraxtonEd Braxton', 'Neil Französisch', ...,
       'John LeeJohn LeeJohn LeeJohn LeeJohn LeeJohn LeeJohn Lee',
       'Grant ThorntonGrant Thornton',
       'Rob LucasRob LucasRob LucasRob LucasRob LucasRob Lucas'],
      dtype=object)

In [45]:
# Question 42: Find customers who placed more than 10 orders.
wp=pds.groupby('Order ID')['Customer Name'].sum().value_counts().apply(lambda x: x>10).sum()
wp

np.int64(0)

In [46]:
# Question 43: Find total number of states represented.
pds['State'].value_counts()

State
California              2001
New York                1128
Texas                    985
Pennsylvania             587
Washington               506
Illinois                 492
Ohio                     469
Florida                  383
Michigan                 255
North Carolina           249
Arizona                  224
Virginia                 224
Georgia                  184
Tennessee                183
Colorado                 182
Indiana                  149
Kentucky                 139
Massachusetts            135
New Jersey               130
Oregon                   124
Wisconsin                110
Maryland                 105
Delaware                  96
Minnesota                 89
Connecticut               82
Missouri                  66
Oklahoma                  66
Alabama                   61
Arkansas                  60
Rhode Island              56
Utah                      53
Mississippi               53
South Carolina            42
Louisiana                 42
Nevada                    39
Nebraska                  38
New Mexico                37
Iowa                      30
New Hampshire             27
Kansas                    24
Idaho                     21
Montana                   15
South Dakota              12
Vermont                   11
District of Columbia      10
Maine                      8
North Dakota               7
West Virginia              4
Wyoming                    1
Name: count, dtype: int64

In [47]:
# Question 44: Find total number of cities represented.
noc=pds['City'].value_counts()
noc

City
New York City    915
Los Angeles      747
Philadelphia     537
San Francisco    510
Seattle          428
                ...
Abilene            1
Montebello         1
Kissimmee          1
Danbury            1
Springdale         1
Name: count, Length: 531, dtype: int64

In [48]:
# Question 45: Find number of orders placed from California.
noo=pds['State'].value_counts()['California']
noo

np.int64(2001)

In [49]:
# Question 46: Find number of orders placed from New York.
noo=pds['State'].value_counts()['New York']
noo

np.int64(1128)

In [50]:
# Question 47: Find number of orders placed from Texas.
noo=pds['State'].value_counts()['Texas']
noo

np.int64(985)

In [51]:
# Question 48: Find number of orders placed from Florida.
noo=pds['State'].value_counts()['Florida']
noo

np.int64(383)

In [52]:
# Question 49: Find number of orders shipped after 5 days of order.

In [53]:
# Question 50: Find average shipping time in days.
pds['Ship Date'].mean()

Timestamp('2016-05-03 23:06:58.571142912')

#Sales & Profit Analysis (Questions 51-100)

In [54]:
# Question 51: Find total sales.
pds['Sales'].value_counts()

Sales
12.960      56
19.440      39
15.552      39
10.368      36
32.400      28
            ..
1706.184     1
911.424      1
407.976      1
68.810       1
2.544        1
Name: count, Length: 6144, dtype: int64

In [55]:
# Question 52: Find total profit.
pds['Profit'].value_counts()

Profit
0.0000     65
6.2208     43
9.3312     38
3.6288     32
5.4432     32
           ..
10.2588     1
1.8688      1
3.2400      1
90.7152     1
1.9656      1
Name: count, Length: 7545, dtype: int64

In [56]:
# Question 53: Find average sales per order.
aspo=pds.groupby('Order ID')['Sales'].sum().mean()
aspo

np.float64(458.61466566180883)

In [57]:
# Question 54: Find average profit per order.
aspo=pds.groupby('Order ID')['Profit'].sum().mean()
aspo

np.float64(57.17648666400478)

In [58]:
# Question 55: Find sales by category.
sbc=pds.groupby('Category')['Sales'].sum()
sbc

Category
Furniture          741999.7953
Office Supplies    719047.0320
Technology         836154.0330
Name: Sales, dtype: float64

In [59]:
# Question 56: Find profit by category.
sbc=pds.groupby('Category')['Profit'].sum()
sbc

Category
Furniture           18451.2728
Office Supplies    122490.8008
Technology         145454.9481
Name: Profit, dtype: float64

In [60]:
# Question 57: Find sales by sub-category.
sbc=pds.groupby('Sub-Category')['Sales'].sum()
sbc

Sub-Category
Accessories    167380.3180
Appliances     107532.1610
Art             27118.7920
Binders        203412.7330
Bookcases      114879.9963
Chairs         328449.1030
Copiers        149528.0300
Envelopes       16476.4020
Fasteners        3024.2800
Furnishings     91705.1640
Labels          12486.3120
Machines       189238.6310
Paper           78479.2060
Phones         330007.0540
Storage        223843.6080
Supplies        46673.5380
Tables         206965.5320
Name: Sales, dtype: float64

In [61]:
# Question 58: Find profit by sub-category.
sbc=pds.groupby('Sub-Category')['Profit'].sum()
sbc

Sub-Category
Accessories    41936.6357
Appliances     18138.0054
Art             6527.7870
Binders        30221.7633
Bookcases      -3472.5560
Chairs         26590.1663
Copiers        55617.8249
Envelopes       6964.1767
Fasteners        949.5182
Furnishings    13059.1436
Labels          5546.2540
Machines        3384.7569
Paper          34053.5693
Phones         44515.7306
Storage        21278.8264
Supplies       -1189.0995
Tables        -17725.4811
Name: Profit, dtype: float64

In [62]:
# Question 59: Find highest sales category.
sbc=pds.groupby('Category')['Sales'].sum().max()
sbc

836154.033

In [63]:
# Question 60: Find highest profit category.
sbc=pds.groupby('Category')['Profit'].sum().max()
sbc

145454.94809999998

In [64]:
# Question 61: Find lowest profit category.
sbc=pds.groupby('Category')['Profit'].sum().idxmin()
sbc

'Furniture'

In [65]:
# Question 62: Find lowest sales sub-category.
sbc=pds.groupby('Sub-Category')['Sales'].sum().idxmin()
sbc

'Fasteners'

In [66]:
# Question 63: Find highest profit sub-category.
sbc=pds.groupby('Sub-Category')['Profit'].sum().idxmax()
sbc

'Copiers'

In [67]:
# Question 64: Find lowest profit sub-category.
sbc=pds.groupby('Sub-Category')['Profit'].sum().idxmin()
sbc

'Tables'

In [68]:
# Question 65: Find top 10 profitable products.
pa=pds.groupby('Product Name')['Profit'].sum()
pa10=pa.nlargest(10)
pa10

Product Name
Canon imageCLASS 2200 Advanced Copier                                          25199.9280
Fellowes PB500 Electric Punch Plastic Comb Binding Machine with Manual Bind     7753.0390
Hewlett Packard LaserJet 3310 Copier                                            6983.8836
Canon PC1060 Personal Laser Copier                                              4570.9347
HP Designjet T520 Inkjet Large Format Printer - 24" Color                       4094.9766
Ativa V4110MDD Micro-Cut Shredder                                               3772.9461
3D Systems Cube Printer, 2nd Generation, Magenta                                3717.9714
Plantronics Savi W720 Multi-Device Wireless Headset System                      3696.2820
Ibico EPK-21 Electric Binding System                                            3345.2823
Zebra ZM400 Thermal Label Printer                                               3343.5360
Name: Profit, dtype: float64

In [69]:
# Question 66: Find top 10 least profitable products.
pa10=pa.nsmallest(10)
pa10

Product Name
Cubify CubeX 3D Printer Double Head Print                           -8879.9704
Lexmark MX611dhe Monochrome Laser Printer                           -4589.9730
Cubify CubeX 3D Printer Triple Head Print                           -3839.9904
Chromcraft Bull-Nose Wood Oval Conference Tables & Bases            -2876.1156
Bush Advantage Collection Racetrack Conference Table                -1934.3976
GBC DocuBind P400 Electric Binding System                           -1878.1662
Cisco TelePresence System EX90 Videoconferencing Unit               -1811.0784
Martin Yale Chadless Opener Electric Letter Opener                  -1299.1836
Balt Solid Wood Round Tables                                        -1201.0581
BoxOffice By Design Rectangular and Half-Moon Meeting Room Tables   -1148.4375
Name: Profit, dtype: float64

In [70]:
# Question 67: Find top 10 best-selling products by sales.
pa=pds.groupby('Product Name')['Sales'].sum()
bs10=pa.nlargest(10)
bs10

Product Name
Canon imageCLASS 2200 Advanced Copier                                          61599.824
Fellowes PB500 Electric Punch Plastic Comb Binding Machine with Manual Bind    27453.384
Cisco TelePresence System EX90 Videoconferencing Unit                          22638.480
HON 5400 Series Task Chairs for Big and Tall                                   21870.576
GBC DocuBind TL300 Electric Binding System                                     19823.479
GBC Ibimaster 500 Manual ProClick Binding System                               19024.500
Hewlett Packard LaserJet 3310 Copier                                           18839.686
HP Designjet T520 Inkjet Large Format Printer - 24" Color                      18374.895
GBC DocuBind P400 Electric Binding System                                      17965.068
High Speed Automatic Electric Letter Opener                                    17030.312
Name: Sales, dtype: float64

In [71]:
# Question 68: Find top 10 best-selling products by quantity.
pa=pds.groupby('Product Name')['Quantity'].sum()
bs10=pa.nlargest(10)
bs10

Product Name
Staples                                                       215
Staple envelope                                               170
Easy-staple paper                                             150
Staples in misc. colors                                        86
KI Adjustable-Height Table                                     74
Avery Non-Stick Binders                                        71
Storex Dura Pro Binders                                        71
GBC Premium Transparent Covers with Diagonal Lined Pattern     67
Situations Contoured Folding Chairs, 4/Set                     64
Staple-based wall hangings                                     62
Name: Quantity, dtype: int64

In [72]:
# Question 69: Find bottom 10 products by sales.
pa=pds.groupby('Product Name')['Sales'].sum()
bs10=pa.nsmallest(10)
bs10

Product Name
Eureka Disposable Bags for Sanitaire Vibra Groomer I Upright Vac    1.624
Avery 5                                                             5.760
Xerox 20                                                            6.480
Grip Seal Envelopes                                                 7.072
Avery Hi-Liter Pen Style Six-Color Fluorescent Set                  7.700
Avery Hi-Liter Comfort Grip Fluorescent Highlighter, Yellow Ink     7.800
Xerox 1989                                                          7.968
4009 Highlighters                                                   8.040
Stockwell Gold Paper Clips                                          8.096
Newell 308                                                          8.400
Name: Sales, dtype: float64

In [73]:
# Question 70: Find bottom 10 products by profit.
pa=pds.groupby('Product Name')['Profit'].sum()
bs10=pa.nsmallest(10)
bs10

Product Name
Cubify CubeX 3D Printer Double Head Print                           -8879.9704
Lexmark MX611dhe Monochrome Laser Printer                           -4589.9730
Cubify CubeX 3D Printer Triple Head Print                           -3839.9904
Chromcraft Bull-Nose Wood Oval Conference Tables & Bases            -2876.1156
Bush Advantage Collection Racetrack Conference Table                -1934.3976
GBC DocuBind P400 Electric Binding System                           -1878.1662
Cisco TelePresence System EX90 Videoconferencing Unit               -1811.0784
Martin Yale Chadless Opener Electric Letter Opener                  -1299.1836
Balt Solid Wood Round Tables                                        -1201.0581
BoxOffice By Design Rectangular and Half-Moon Meeting Room Tables   -1148.4375
Name: Profit, dtype: float64

In [74]:
# Question 71: Find total sales by year.
pds['Years']=pds['Order Date'].dt.year
ts=pds.groupby('Years')['Sales'].sum()
ts

Years
2014    484247.4981
2015    470532.5090
2016    609205.5980
2017    733215.2552
Name: Sales, dtype: float64

In [75]:
# Question 72: Find total profit by year.
ts=pds.groupby('Years')['Profit'].sum()
ts

Years
2014    49543.9741
2015    61618.6037
2016    81795.1743
2017    93439.2696
Name: Profit, dtype: float64

In [76]:
# Question 73: Find sales growth year by year.
sg=pds.groupby('Years')['Sales'].value_counts()
sg

Years  Sales
2014   15.552       11
       10.368        9
       19.440        9
       12.960        8
       25.920        7
                    ..
2017   5443.960      1
       7999.980      1
       10499.970     1
       11199.968     1
       13999.960     1
Name: count, Length: 8222, dtype: int64

In [77]:
# Question 74: Find profit growth year by year.
sg=pds.groupby('Years')['Profit'].value_counts()
sg

Years  Profit
2014   0.0000       17
       5.4432       10
       3.6288        9
       9.3312        8
       12.4416       7
                    ..
2017   1906.4850     1
       2504.2216     1
       3919.9888     1
       5039.9856     1
       6719.9808     1
Name: count, Length: 8971, dtype: int64

In [78]:
# Question 75: Find sales by quarter.
pds['Quarter']=pds['Order Date'].dt.quarter
sg=pds.groupby('Quarter')['Sales'].sum().value_counts()
sg

Sales
359681.5758    1
445509.6196    1
613932.1057    1
878077.5592    1
Name: count, dtype: int64

In [79]:
# Question 76: Find profit by quarter.
sg=pds.groupby('Quarter')['Profit'].sum().value_counts()
sg

Profit
48023.7440     1
55284.5395     1
72467.0785     1
110621.6597    1
Name: count, dtype: int64

In [80]:
# Question 77: Find sales by month.
pds['Month']=pds['Order Date'].dt.month
sg=pds.groupby('Month')['Sales'].sum().value_counts()
sg

Sales
94924.8356     1
59751.2514     1
205005.4888    1
137762.1286    1
155028.8117    1
152718.6793    1
147238.0970    1
159044.0630    1
307649.9457    1
200322.9847    1
352461.0710    1
325293.5035    1
Name: count, dtype: int64

In [81]:
# Question 78: Find profit by month.
sg=pds.groupby('Month')['Profit'].sum().value_counts()
sg

Profit
9134.4461     1
10294.6107    1
28594.6872    1
11587.4363    1
22411.3078    1
21285.7954    1
13832.6648    1
21776.9384    1
36857.4753    1
31784.0413    1
35468.4265    1
43369.1919    1
Name: count, dtype: int64

In [82]:
# Question 79: Find month with highest sales.
sg=pds.groupby('Month')['Sales'].max()
sg

Month
1      5443.960
2      8749.950
3     22638.480
4      9099.930
5      8399.976
6      4476.800
7      8187.650
8      4416.174
9      9449.950
10    17499.950
11    10499.970
12     9892.740
Name: Sales, dtype: float64

In [83]:
# Question 80: Find month with highest profit.
sg=pds.groupby('Month')['Profit'].max()
sg

Month
1     2504.2216
2     2799.9840
3     6719.9808
4     2365.9818
5     1276.4871
6     1668.2050
7      944.9865
8     1453.1238
9     4630.4755
10    8399.9760
11    5039.9856
12    4946.3700
Name: Profit, dtype: float64

In [84]:
# Question 81: Find month with lowest sales.
sg=pds.groupby('Month')['Sales'].min()
sg

Month
1     1.728
2     1.080
3     0.556
4     1.188
5     1.188
6     0.444
7     1.044
8     1.362
9     0.876
10    0.898
11    1.192
12    1.167
Name: Sales, dtype: float64

In [85]:
# Question 82: Find month with lowest profit.
sg=pds.groupby('Month')['Profit'].min()
sg

Month
1    -1862.3124
2     -426.9860
3    -1811.0784
4    -3399.9800
5     -458.1468
6     -525.6405
7    -3701.8928
8    -1237.8462
9    -1665.0522
10   -1306.5504
11   -6599.9780
12   -2929.4845
Name: Profit, dtype: float64

In [86]:
# Question 83: Find total sales by weekday.
pds['Weekday']=pds['Order Date'].dt.weekday
ts=pds.groupby('Weekday')['Sales'].sum()
ts

Weekday
0    428937.8157
1    287209.5022
2     88056.9752
3    321965.7785
4    427692.2593
5    357984.6830
6    385353.8464
Name: Sales, dtype: float64

In [87]:
# Question 84: Find total profit by weekday.
ts=pds.groupby('Weekday')['Profit'].sum()
ts

Weekday
0    51511.1146
1    35570.3288
2    14703.8707
3    39683.7512
4    46520.8242
5    41277.6202
6    57129.5120
Name: Profit, dtype: float64

In [88]:
# Question 85: Find weekday with highest sales.
pds['Weekday']=pds['Order Date'].dt.weekday.max()
ts=pds.groupby('Weekday')['Sales'].sum()
ts

Weekday
6    2.297201e+06
Name: Sales, dtype: float64

In [89]:
# Question 86: Find weekday with lowest sales.
pds['Weekday']=pds['Order Date'].dt.weekday.min()
ts=pds.groupby('Weekday')['Sales'].sum()
ts

Weekday
0    2.297201e+06
Name: Sales, dtype: float64

In [90]:
# Question 87: Find weekday with highest profit.
pds['Weekday']=pds['Order Date'].dt.weekday.max()
ts=pds.groupby('Weekday')['Profit'].sum()
ts

Weekday
6    286397.0217
Name: Profit, dtype: float64

In [91]:
# Question 88: Find weekday with lowest profit.
pds['Weekday']=pds['Order Date'].dt.weekday.min()
ts=pds.groupby('Weekday')['Profit'].sum()
ts

Weekday
0    286397.0217
Name: Profit, dtype: float64

In [92]:
# Question 89: Find state with highest sales.
pds.groupby('State')['Sales'].sum().idxmax()

'California'

In [93]:
# Question 90: Find state with highest profit.
pds.groupby('State')['Profit'].sum().idxmax()

'California'

In [94]:
# Question 91: Find state with lowest sales.
pds.groupby('State')['Sales'].sum().idxmin()

'North Dakota'

In [95]:
# Question 92: Find state with lowest profit.
pds.groupby('State')['Profit'].sum().idxmin()

'Texas'

In [96]:
# Question 93: Find region with highest sales.
pds.groupby('Region')['Sales'].sum().idxmax()

'West'

In [97]:
# Question 94: Find region with highest profit.
pds.groupby('Region')['Profit'].sum().idxmax()

'West'

In [98]:
# Question 95: Find region with lowest sales.
pds.groupby('Region')['Sales'].sum().idxmin()

'South'

In [99]:
# Question 96: Find region with lowest profit.
pds.groupby('Region')['Profit'].sum().idxmin()

'Central'

In [100]:
# Question 97: Find average discount overall.
pds['avgerage discount']=pds['Discount'].sum().mean()
pds['avgerage discount']

0       1561.09
1       1561.09
2       1561.09
3       1561.09
4       1561.09
         ...
9989    1561.09
9990    1561.09
9991    1561.09
9992    1561.09
9993    1561.09
Name: avgerage discount, Length: 9994, dtype: float64

In [101]:
# Question 98: Find average discount in each category.
avd=pds.groupby('Category')['avgerage discount'].sum()
avd

Category
Furniture          3311071.89
Office Supplies    9407128.34
Technology         2883333.23
Name: avgerage discount, dtype: float64

In [102]:
# Question 99: Find average discount in each sub-category.
avd=pds.groupby('Sub-Category')['avgerage discount'].sum()
avd

Sub-Category
Accessories    1209844.75
Appliances      727467.94
Art            1242627.64
Binders        2377540.07
Bookcases       355928.52
Chairs          963192.53
Copiers         106154.12
Envelopes       396516.86
Fasteners       338756.53
Furnishings    1493963.13
Labels          568236.76
Machines        179525.35
Paper          2138693.30
Phones         1387809.01
Storage        1320682.14
Supplies        296607.10
Tables          497987.71
Name: avgerage discount, dtype: float64

In [103]:
# Question 100: Compare total sales vs profit across regions.

#Customer & Segment Analysis (Questions 101-150)

In [104]:
# Question 101: Count customers in each region.
cc=pds.groupby('Region')['Customer Name'].unique()
cc

Region
Central    [Harold Pawlan, Pete Kriz, Ken Black, Matt Abe...
East       [Sandra Flanagan, Tracy Blumstein, Lena Hernan...
South      [Claire Gute, Sean O'Donnell, Andrew Allen, Er...
West       [Darrin Van Huff, Brosina Hoffman, Irene Maddo...
Name: Customer Name, dtype: object

In [105]:
# Question 102: Count customers in each state.
cc=pds.groupby('State')['Customer Name'].unique()
cc

State
Alabama                 [Stewart Carmichael, Rob Lucas, Dan Campbell, ...
Arizona                 [Brendan Sweed, Troy Staebel, Tamara Willingha...
Arkansas                [Maribeth Dona, Thomas Brumley, Hunter Lopez, ...
California              [Darrin Van Huff, Brosina Hoffman, Zuschuss Do...
Colorado                [Lena Cacioppo, Bruce Stewart, Kelly Lampkin, ...
Connecticut             [Sally Knutson, Michael Kennedy, Sample Compan...
Delaware                [Lena Hernandez, Steven Cartwright, Seth Verno...
District of Columbia    [Greg Tran, Toby Braunhardt, Dianna Arnett, To...
Florida                 [Sean O'Donnell, Erin Smith, Christopher Schil...
Georgia                 [Victoria Brennan, Christopher Martinez, Denny...
Idaho                   [Nick Zandusky, Heather Kirkland, Noel Staavos...
Illinois                [Linda Cazamias, Paul Stevenson, Christopher S...
Indiana                 [Darren Powers, Troy Blackwell, Chuck Clark, R...
Iowa                    [Clay Ludtke, Benjamin Venier, Patrick O'Brill...
Kansas                  [Brad Eason, Kalyca Meade, Rob Williams, Rick ...
Kentucky                [Claire Gute, Victoria Brennan, Darren Koutras...
Louisiana               [Robert Marley, Chris Selesnick, Mike Caudle, ...
Maine                   [Laura Armstrong, Penelope Sewall, Marina Lich...
Maryland                [Ed Ludwig, Brad Thomas, Joel Eaton, Michael G...
Massachusetts           [Tamara Dahlen, Allen Rosenblatt, Michael Paig...
Michigan                [Patrick O'Donnell, Tracy Blumstein, Joseph Ho...
Minnesota               [Odella Nelson, Paul Gonzalez, Karl Braun, Elp...
Mississippi             [Natalie Fritzler, Michael Chen, Valerie Domin...
Missouri                [Sandra Glassco, Lynn Smith, Ed Ludwig, Robert...
Montana                 [Alan Dominguez, Jas O'Carroll, Carl Weiss, Ro...
Nebraska                [Ken Black, Allen Armold, Lindsay Shagiari, Br...
Nevada                  [Victor Preis, Kelly Lampkin, Michael Chen, Ro...
New Hampshire           [Tracy Blumstein, Chuck Clark, Adam Bellavance...
New Jersey              [Valerie Mitchum, Paul Gonzalez, Jonathan Dohe...
New Mexico              [Ruben Dartt, Ruben Ausman, Anthony Witt, Mich...
New York                [Janet Molinari, Ted Butterfield, Henry MacAll...
North Carolina          [Andrew Allen, Julie Creighton, Janet Martin, ...
North Dakota                            [Nat Carroll, Christopher Schild]
Ohio                    [Ryan Crowe, Dorothy Wardle, Maureen Gastineau...
Oklahoma                [Nora Paige, Ken Heidel, Phillip Breyer, Sara ...
Oregon                  [Roger Barcio, Tracy Blumstein, Zuschuss Carro...
Pennsylvania            [Sandra Flanagan, Tracy Blumstein, Jonathan Do...
Rhode Island            [Saphhira Shifley, Gene McClure, Bill Donatell...
South Carolina          [Patrick O'Donnell, Erin Ashbrook, Clay Ludtke...
South Dakota            [Elizabeth Moffitt, Raymond Buch, Victoria Wil...
Tennessee               [Joel Eaton, Greg Guthrie, Heather Kirkland, V...
Texas                   [Harold Pawlan, Matt Abelman, Gene Hale, Steve...
Utah                    [Alejandro Grove, Emily Burns, Ken Lonsdale, C...
Vermont                 [Quincy Jones, Stewart Visinsky, Valerie Mitch...
Virginia                [Karen Daniels, Shahid Hopkins, Naresj Patel, ...
Washington              [Irene Maddox, Dave Kipp, Neil Knudson, Dave B...
West Virginia                       [Eugene Hildebrand, Natalie Fritzler]
Wisconsin               [Pete Kriz, Justin Ellison, Bradley Drucker, B...
Wyoming                                                 [Michelle Arnett]
Name: Customer Name, dtype: object

In [106]:
# Question 103: Count customers in each city.
cc=pds.groupby('City')['Customer Name'].unique()
cc

City
Aberdeen                                       [Jeremy Lonsdale]
Abilene                                            [Dennis Kane]
Akron          [Maria Bertelson, Ed Braxton, Ted Trevino, Mar...
Albuquerque    [Michelle Lonsdale, Benjamin Farhat, Shui Tom,...
Alexandria     [Roy Collins, Shirley Daniels, Tom Boeckenhaue...
                                     ...
Woonsocket            [Andy Reiter, Kristen Hastings, Don Jones]
Yonkers        [Karen Daniels, Alan Dominguez, Nathan Cano, M...
York                                [Theresa Swint, Noah Childs]
Yucaipa                                          [Odella Nelson]
Yuma           [Nick Zandusky, Tiffany House, Gary Hansen, Da...
Name: Customer Name, Length: 531, dtype: object

In [107]:
# Question 104: Find total sales by customer.
ts=pds.groupby('Customer Name')['Sales'].sum()
ts

Customer Name
Aaron Bergman          886.156
Aaron Hawkins         1744.700
Aaron Smayling        3050.692
Adam Bellavance       7755.620
Adam Hart             3250.337
                        ...
Xylona Preis          2374.658
Yana Sorensen         6720.444
Yoseph Carroll        5454.350
Zuschuss Carroll      8025.707
Zuschuss Donatelli    1493.944
Name: Sales, Length: 793, dtype: float64

In [108]:
# Question 105: Find total profit by customer.
ts=pds.groupby('Customer Name')['Profit'].sum()
ts

Customer Name
Aaron Bergman          129.3465
Aaron Hawkins          365.2152
Aaron Smayling        -253.5746
Adam Bellavance       2054.5885
Adam Hart              281.1890
                        ...
Xylona Preis           621.2300
Yana Sorensen         1778.2923
Yoseph Carroll        1305.6290
Zuschuss Carroll     -1032.1490
Zuschuss Donatelli     249.1307
Name: Profit, Length: 793, dtype: float64

In [109]:
# Question 106: Find average sales per customer.
ts=pds.groupby('Customer Name')['Sales'].sum().mean()
ts

np.float64(2896.848499747793)

In [110]:
# Question 107: Find average profit per customer.
ts=pds.groupby('Customer Name')['Profit'].sum().mean()
ts

np.float64(361.1563955863807)

In [111]:
# Question 108: Find customer with highest sales.
ts=pds.groupby('Customer Name')['Sales'].sum().idxmax()
ts

'Sean Miller'

In [112]:
# Question 109: Find customer with highest profit.
ts=pds.groupby('Customer Name')['Profit'].sum().idxmax()
ts

'Tamara Chand'

In [113]:
# Question 110: Find customer with lowest sales.
ts=pds.groupby('Customer Name')['Sales'].sum().idxmin()
ts

'Thais Sissman'

In [114]:
# Question 111: Find customer with lowest profit.
ts=pds.groupby('Customer Name')['Profit'].sum().idxmin()
ts

'Cindy Stewart'

In [158]:
# Question 112: Find customers with negative profit.
pds['Profit']<0

0       False
1       False
2       False
3        True
4       False
        ...
9989    False
9990    False
9991    False
9992    False
9993    False
Name: Profit, Length: 9994, dtype: bool

In [183]:
# Question 113: Find customers with > 10 orders.
c=pds.groupby('Customer Name').size() > 10
c

Customer Name
Aaron Bergman         False
Aaron Hawkins          True
Aaron Smayling        False
Adam Bellavance        True
Adam Hart              True
                      ...
Xylona Preis           True
Yana Sorensen          True
Yoseph Carroll        False
Zuschuss Carroll       True
Zuschuss Donatelli    False
Length: 793, dtype: bool

In [184]:
# Question 114: Find customers with < 2 orders.
c=pds.groupby('Customer Name').size() < 2
c

Customer Name
Aaron Bergman         False
Aaron Hawkins         False
Aaron Smayling        False
Adam Bellavance       False
Adam Hart             False
                      ...
Xylona Preis          False
Yana Sorensen         False
Yoseph Carroll        False
Zuschuss Carroll      False
Zuschuss Donatelli    False
Length: 793, dtype: bool

In [187]:
# Question 115: Find repeat customers across multiple years.
pds['Year'] =pds['Order Date'].dt.year
ca=pds.groupby('Customer Name')['Year'].nunique().loc[lambda x: x > 1]
ca

Customer Name
Aaron Bergman         2
Aaron Hawkins         4
Aaron Smayling        3
Adam Bellavance       3
Adam Hart             4
                     ..
Xylona Preis          4
Yana Sorensen         2
Yoseph Carroll        4
Zuschuss Carroll      4
Zuschuss Donatelli    3
Name: Year, Length: 772, dtype: int64

In [196]:
# Question 116: Find customers who ordered only once.
oc=pds.groupby('Customer Name').size()
oo=oc[oc == 1]
oo

Customer Name
Anthony O'Donnell    1
Carl Jackson         1
Jocasta Rupert       1
Lela Donovan         1
Ricardo Emerson      1
dtype: int64

In [197]:
# Question 117: Count customers by segment.
c=pds.groupby('Segment')['Customer Name'].count()
c

Segment
Consumer       5191
Corporate      3020
Home Office    1783
Name: Customer Name, dtype: int64

In [204]:
# Question 118: Find sales by segment.
s=pds.groupby('Segment')['Sales'].sum()
s

Segment
Consumer       1.161401e+06
Corporate      7.061464e+05
Home Office    4.296531e+05
Name: Sales, dtype: float64

In [203]:
# Question 119: Find profit by segment.
s=pds.groupby('Segment')['Profit'].sum()
s

Segment
Consumer       134119.2092
Corporate       91979.1340
Home Office     60298.6785
Name: Profit, dtype: float64

In [210]:
# Question 120: Find most profitable segment.
s=pds.groupby('Segment')['Profit'].idxmax()
s

Segment
Consumer       8153
Corporate      6826
Home Office    2623
Name: Profit, dtype: int64

In [211]:
# Question 121: Find least profitable segment.
s=pds.groupby('Segment')['Profit'].idxmin()
s

Segment
Consumer       7772
Corporate       683
Home Office    3011
Name: Profit, dtype: int64

In [215]:
# Question 122: Find most sales-generating segment.
s=pds.groupby('Segment')['Sales'].max()
s

Segment
Consumer       13999.96
Corporate      17499.95
Home Office    22638.48
Name: Sales, dtype: float64

In [216]:
# Question 123: Find least sales-generating segment.
s=pds.groupby('Segment')['Sales'].min()
s

Segment
Consumer       0.444
Corporate      0.556
Home Office    0.990
Name: Sales, dtype: float64

In [226]:
# Question 124: Find segment with highest average discount.
s=pds.groupby('Segment')['Discount'].idxmax().mean()
s

np.float64(86.0)

In [227]:
# Question 125: Find segment with lowest average discount.
s=pds.groupby('Segment')['Discount'].idxmin().mean()
s

np.float64(32.666666666666664)

In [238]:
# Question 126: Find top 5 customers by sales in each segment.
ft=pds.groupby('Segment')['Sales'].sum()
tp5=ft.nlargest(5)
tp5

Segment
Consumer       1.161401e+06
Corporate      7.061464e+05
Home Office    4.296531e+05
Name: Sales, dtype: float64

In [239]:
# Question 127: Find top 5 customers by profit in each segment.
ft=pds.groupby('Segment')['Profit'].sum()
tp5=ft.nlargest(5)
tp5

Segment
Consumer       134119.2092
Corporate       91979.1340
Home Office     60298.6785
Name: Profit, dtype: float64

In [240]:
# Question 128: Find top 5 loss-making customers.
ft=pds.groupby('Segment')['Sales'].sum()
tp5=ft.nsmallest(5)
tp5

Segment
Home Office    4.296531e+05
Corporate      7.061464e+05
Consumer       1.161401e+06
Name: Sales, dtype: float64

In [132]:
# Question 129: Find customers with largest order value.

In [133]:
# Question 130: Find customers with smallest order value.

In [134]:
# Question 131: Find number of unique customers each year.

In [135]:
# Question 132: Find retention rate year over year.

In [136]:
# Question 133: Find churned customers (present last year, not this year).

In [137]:
# Question 134: Find new customers (present this year, not last year).

In [138]:
# Question 135: Find sales contribution of top 10 customers.

In [139]:
# Question 136: Find profit contribution of top 10 customers.

In [140]:
# Question 137: Find customers who purchased from all categories.

In [141]:
# Question 138: Find customers who purchased only furniture.

In [142]:
# Question 139: Find customers who purchased only technology.

In [143]:
# Question 140: Find customers who purchased only office supplies.

In [144]:
# Question 141: Find average order size per segment.

In [145]:
# Question 142: Find average discount per segment.

In [146]:
# Question 143: Find segment with maximum number of customers.

In [147]:
# Question 144: Find segment with minimum number of customers.

In [148]:
# Question 145: Find customer with maximum quantity purchased.

In [149]:
# Question 146: Find customer with minimum quantity purchased.

In [150]:
# Question 147: Find customer who bought most different products.

In [151]:
# Question 148: Find customer who bought most categories.

In [152]:
# Question 149: Find customer who bought most sub-categories.

In [153]:
# Question 150: Find customer who bought across most states.

#Product & Category Analysis (Questions 151-200)